# taps
tap "homebrew/cask" || true
tap "homebrew/cask-fonts" || true

# cask
cask_args appdir: "/Applications"

# browsers
cask "google-chrome"

# editors
cask "visual-studio-code"
cask "emacs"

# fonts
cask "font-hasklig"

# languages
brew "asdf"
brew "elm-format"

# socials
cask "telegram"
cask "slack"

# terminal
cask "iterm2"
brew "antigen"
brew "git"
brew "hub"
brew "tig"
brew "diff-so-fancy"
brew "autojump"
brew "the_silver_searcher"
brew "tree"
brew "bat"
brew "tldr"
brew "jq"
brew "ncdu"
brew "pidof"
brew "htop"
brew "httpie"
brew "fzf"
brew "gpg"
brew "cloc"
brew "yqrashawn/goku/goku"

# ui
cask "dozer"
cask "flux"

# utils
cask "rectangle"
cask "jumpcut"
cask "tomighty"
cask "ngrok"
cask "mos"
cask "docker"
cask "unclack"
cask "karabiner-elements"
cask "hammerspoon"

# productivity
brew "ical-buddy"
